// app.js
App({
  onLaunch: function () {
    //当小程序初始化完成时，会触发onLaunch（全局只触发一次）
  },
  onShow: function () {
    //当小程序启动，或从后台进入前台显示，会触发onShow
  },
  onHide: function () {
    //当小程序从前台进入后台，会触发onHide
  },
  onError: function (msg) {
    //当小程序发生脚本错误，或者api调用失败时，会触发onError并带上错误信息
  },
  other: function () {
    //全局函数，可以被项目上的其他js文件调用
  },
  globalData: {
    //全局对象
        partnerList: {
      "n": {
        "title": "N（2021週年慶）&萊希拉姆",
        "source": "限定",
        "position": "输出——进攻组输出",
        "picture": "cloud://cloud1-6gwz4o834180f733.636c-cloud1-6gwz4o834180f733-1307158905/icons/N（2021週年慶）&萊希拉姆.png",
        "detail": {
          "attr": {
            "level": "A+",
            "reason": `作为一个输出，其主要输出端是物理端。
            在130级满星的情况下，其白值为439，处于400-450之间。
            故白值评级定为B。`
          },
          "skill": {
            "level": "A+",
            "reason": `胖丁的大威力技能为133威力的嬉闹，技能威力处于100-175之间，算是一般水平；
            胖丁的拍技为300威力无倍率拍技，拍技本身很一般；
            夏日琴音的训练师技能可以为胖丁带来+3会心+2双攻的自强化，自强化程度只能算是一般水平。
            纵观胖丁的技能组，训练师技能需要胖丁处于睡眠状态才能发挥作用，且嬉闹自身命中只有90，命中有一点低。故胖丁的技能组是存在使用代价的。
            综上，胖丁的技能组评级为：A+、`
          },
          "passive": {
            "level": "B",
            "reason": `胖丁的被动有三个。

            一个是拍技后赋予睡眠，这个被动看起来很美好，但实际上却很辣鸡。一方面，由于拍技是单体的（现在没出ex），这使得胖丁的被动只能对一个人生效，另一方面，一轮需要三个回合，哪怕是睡眠抗性最低（抗性5），你也无法保证能够永续催眠，而且使用拍技会干扰你的现有节奏。
            
            另外两个是攻击时攻击提升2和宝可梦出招后特攻↑2，这两个被动可以概率提高胖丁的双攻。但因为这两个被动的触发是有概率的，所以这两个被动只能当做甜点看待而非主菜。
            
            综上，胖丁的被动评级为：B。`
          },
          "grid": {
            "level": "S",
            "reason": ``
          },
          "focus": {
            "level": "B-",
            "reason": "作为一个输出，胖丁的技能威力处于60万-70万的区间之内。故胖丁的专精度评级为：B-。"
          },
          "rely": {
            "level": "C+",
            "reason": `胖丁自身的白值处于一般水平，故胖丁对升星卡带来的白值提升的需求处于一般水平；

            胖丁石盘中最重要的部分：对手睡眠时技能威力提升5和对手睡眠时拍技威力提升5，前者在三宝才能点到，后者在二宝就能点到，所以说胖丁的石盘并不能说是在三宝产生质变，只是说在三宝才能成为完全体，但考虑到现阶段后者不如前者重要，所以说胖丁在现阶段属于三宝才能产生质变的拍组；
            
            胖丁需要的潜能为输出通用的CT2，这个潜能对胖丁来说能够提升自己的技能威力，不过并不能说是胖丁亟需的潜能；
            
            作为一个输出，胖丁需要升宝带来的技能威力增幅，且自身的拍技有着额外的的用处（以及自己可以走拍技流），故胖丁对技能组的需求很大。
            
            综上，胖丁的依赖度评级为：C+。`
          },
          "common": {
            "level": "B",
            "reason": `即使是在石盘的加成之下，胖丁的技能威力也只能说是一般水平；而胖丁的自强化还是和以前差不多，只能说算是一般水平；胖丁自身技能组的代价可以通过石盘来弥补，此处为加分项；胖丁自身速度很慢，且缺乏提升速度的手段，这使得胖丁的回槽速度很慢，这里可以算作扣分项。综上，故评级为：A-。

            胖丁自身需要双攻的补充，所以需要一个队友来弥补自身的这一局限性，故评级为：B+。
            
            胖丁基本上不会有什么人考虑使用，自身的实力也就属于在自己的对策本有着自己的发挥空间的级别，故评级为：C。
            
            综上，胖丁的通用性评级为：B。`
          }
        },
        "score": 48
      },
      "dawu": {
        "title": "大吾（2021週年慶）&烈空坐",
        "source": "限定",
        "position": "输出——进攻组输出",
        "picture": "cloud://cloud1-6gwz4o834180f733.636c-cloud1-6gwz4o834180f733-1307158905/icons/大吾（2021週年慶）&烈空坐.png",
        "detail": {
          "attr": {
            "level": "A+",
            "reason": `作为一个输出，其主要输出端是物理端。

            在130级满星的情况下，其白值为439，处于400-450之间。

            故白值评级定为B。`
          },
          "skill": {
            "level": "A+",
            "reason": `胖丁的大威力技能为133威力的嬉闹，技能威力处于100-175之间，算是一般水平；

            胖丁的拍技为300威力无倍率拍技，拍技本身很一般；
            
            夏日琴音的训练师技能可以为胖丁带来+3会心+2双攻的自强化，自强化程度只能算是一般水平。
            
            纵观胖丁的技能组，训练师技能需要胖丁处于睡眠状态才能发挥作用，且嬉闹自身命中只有90，命中有一点低。故胖丁的技能组是存在使用代价的。
            
            综上，胖丁的技能组评级为：A+、`
          },
          "passive": {
            "level": "B",
            "reason": `胖丁的被动有三个。

            一个是拍技后赋予睡眠，这个被动看起来很美好，但实际上却很辣鸡。一方面，由于拍技是单体的（现在没出ex），这使得胖丁的被动只能对一个人生效，另一方面，一轮需要三个回合，哪怕是睡眠抗性最低（抗性5），你也无法保证能够永续催眠，而且使用拍技会干扰你的现有节奏。
            
            另外两个是攻击时攻击提升2和宝可梦出招后特攻↑2，这两个被动可以概率提高胖丁的双攻。但因为这两个被动的触发是有概率的，所以这两个被动只能当做甜点看待而非主菜。
            
            综上，胖丁的被动评级为：B。`
          },
          "grid": {
            "level": "S",
            "reason": ``
          },
          "focus": {
            "level": "B-",
            "reason": "作为一个输出，胖丁的技能威力处于60万-70万的区间之内。故胖丁的专精度评级为：B-。"
          },
          "rely": {
            "level": "C+",
            "reason": `胖丁自身的白值处于一般水平，故胖丁对升星卡带来的白值提升的需求处于一般水平；

            胖丁石盘中最重要的部分：对手睡眠时技能威力提升5和对手睡眠时拍技威力提升5，前者在三宝才能点到，后者在二宝就能点到，所以说胖丁的石盘并不能说是在三宝产生质变，只是说在三宝才能成为完全体，但考虑到现阶段后者不如前者重要，所以说胖丁在现阶段属于三宝才能产生质变的拍组；
            
            胖丁需要的潜能为输出通用的CT2，这个潜能对胖丁来说能够提升自己的技能威力，不过并不能说是胖丁亟需的潜能；
            
            作为一个输出，胖丁需要升宝带来的技能威力增幅，且自身的拍技有着额外的的用处（以及自己可以走拍技流），故胖丁对技能组的需求很大。
            
            综上，胖丁的依赖度评级为：C+。`
          },
          "common": {
            "level": "B",
            "reason": `即使是在石盘的加成之下，胖丁的技能威力也只能说是一般水平；而胖丁的自强化还是和以前差不多，只能说算是一般水平；胖丁自身技能组的代价可以通过石盘来弥补，此处为加分项；胖丁自身速度很慢，且缺乏提升速度的手段，这使得胖丁的回槽速度很慢，这里可以算作扣分项。综上，故评级为：A-。

            胖丁自身需要双攻的补充，所以需要一个队友来弥补自身的这一局限性，故评级为：B+。
            
            胖丁基本上不会有什么人考虑使用，自身的实力也就属于在自己的对策本有着自己的发挥空间的级别，故评级为：C。
            
            综上，胖丁的通用性评级为：B。`
          }
        },
        "score": 52
      }
    }
  },
})
